















// для решения задач используйте эти переменные
let a1_res = [],
    a2_res = [],
    a3_res = [],
    a4_res = [],
    b1_res = [],
    b6_res = [],
    b7_res = [],
    b8_res = [],
    b9_num = [],
    b9_string = [],
    b10_res;

// Task 1 ============================================
/* Дан массив a1 = [4, 5, 6, 7, 12, 34, 56, 78, 90, 11] - с помощью map переберите 
массив и создайте новый массив a1_res куда добавьте элементы данного массива умноженные 
на 2. Возвратите массив  a1_res. */

let a1 = [4, 5, 6, 7, 12, 34, 56, 78, 90, 11];

function t1() {
    a1_res = a1.map(elem => {
       return elem*2;
    });
    return a1_res;
}

document.querySelector('.b-1').onclick = () => {
    console.log(t1());
}

// Task 2 ============================================
/*  Дан массив a2= [2,3,4,5,10,11,12] - с помощью map переберите массив и создайте 
массив a2_res куда добавьте элементы данного массива возведенные во вторую степень. 
Возвратите массив a2_res. Действия должны запускаться при вызове функции t2.*/

let a2 = [2,3,4,5,10,11,12];

function t2() {

}

document.querySelector('.b-2').onclick = () => {
    console.log(t2());
}