// Task 0 ============================================










//!----------------------------------------------------------------------------------------
//!----------------------------------------------------------------------------------------
//!----------------------------------------------------------------------------------------
// Task 1 ============================================
/* Добавьте на блок .div-1 событие клик и по клику запуск функции t1. Функция должна 
возвращать и выводить на экран содержимое блока (только текст). Вывод осуществляется 
в out-1.  */

function t1() {
}

// ваше событие здесь!!!