// Task 0 ============================================
// Вешаем событие
document.querySelector('.one').onclick = function (event) {
   console.log(event);
   console.log('click');
}

document.querySelector('.two').onclick = function () {
   console.log('ckick2');
}






//!----------------------------------------------------------------------------------------
//!----------------------------------------------------------------------------------------
//!----------------------------------------------------------------------------------------
// Task 1 ============================================
/* Добавьте на блок .div-1 событие клик и по клику запуск функции t1. Функция должна 
возвращать и выводить на экран содержимое блока (только текст). Вывод осуществляется 
в out-1.  */

function t1() {
}

// ваше событие здесь!!!