











//! ------------------------------------------------------------------------------------------

//  Task 1
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// ***_***_***_
// </pre>
// <p>где звездочки рисуются с помощью внутреннего цикла от 0 до 3, а _ с помощью внешнего.</p>

function t1() {

}

document.querySelector('.b-1').onclick = t1;

//  Task 2
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 1
// *_*_*_
// 2
// *_*_*_
// 3
// *_*_*_
// </pre>
// <p>Решить задачу с помощью вложенных циклов. Внешний цикл выводит цифры и перенос строки br, , второй звездочки, знак подчеркивания и знак переноса.</p>
function t2() {

}

document.querySelector('.b-2').onclick = t2;


//  Task 3
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// *_*_*_
// *_*_*_
// *_*_*_
// *_*_*_
// </pre>
// <p>Решить задачу с помощью вложенных циклов. Внешний цикл выводит перенос строки br,  внутренний -  звездочки, знак подчеркивания.</p>
function t3() {

}

document.querySelector('.b-3').onclick = t3;

//  Task 4
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 1_1 2 3 4 5 2_1 2 3 4 5 3_1 2 3 4 5
// </pre>
function t4() {

}

document.querySelector('.b-4').onclick = t4;


//  Task 5
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 101010
// 101010
// 101010
// </pre>
// <p>Внешний цикл выводит перенос строки br. Вложенный цикл от 0 до 6 выводит либо 0 либо 1.</p>
function t5() {

}

document.querySelector('.b-5').onclick = t5;


//  Task 6
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 10x01x
// 10x01x
// 10x01x
// </pre>
// <p>Внешний цикл выводит перенос строки br. Вложенный цикл от 0 до 6 выводит либо 0 либо 1 либо х.</p>
function t6() {

}

document.querySelector('.b-6').onclick = t6;


//  Task 7
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// *
// **
// ***
// ****
// </pre>
// <p>Внешний цикл выводит перенос строки br. Вложенный цикл запускается от нуля до i и рисует звездочку.</p>
function t7() {

}

document.querySelector('.b-7').onclick = t7;


//  Task 8
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// *****
// ****
// ***
// **
// *
// </pre>
// <p>Внешний цикл выводит перенос строки br. Вложенный цикл рисует звездочки. </p>
function t8() {

}

document.querySelector('.b-8').onclick = t8;


//  Task 9
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 1
// 1 2
// 1 2 3
// 1 2 3 4
// 1 2 3 4 5
// </pre>
// <p>Внешний цикл выводит перенос строки br. Вложенный цикл рисует цифры</p>
function t9() {

}

document.querySelector('.b-9').onclick = t9;


//  Task 10
// <p>С помощью вложенных циклов, нарисуйте строку:</p>
// <pre>
// 01 02 03 04 05 06 07 08 09 10
// 11 12 13 14 15 16 17 18 19 20
// 21 22 23 24 25 26 27 28 29 30
// 31 32 33 34 35 36 37 38 39 40
// 41 42 43 44 45 46 47 48 49 50
// </pre>
// <p>Внешний цикл выводит перенос строки br и запускается от 0 до 6.</p>
// <p>Вложенный цикл рисует цифры от 0 до 9. Обратите внимание, что первый ряд - есть ведущий нуль. Здесь все просто - проверили, если число меньше 10 - то конкатенируем нуль.</p>
function t10() {

}

document.querySelector('.b-10').onclick = t10;


//!------------------------------------------------------------------------------------------

// Задачи на прокачку 1
	
// Используя вложенные циклы создайте таблицу умножения от 1 до 10. Т.е. 
// вначале столбец 1x1, 1x2...1x9 потом 2x1, 2x2 ... 2x9 и так далее. 
// Оформить в виде столбцов где выводятся множители и результат.


function t11() {

}
document.querySelector('.b-11').onclick = t11;

// Задачи на прокачку 2
// С помощью вложенных циклов и символа * нарисуйте:

//    *****
//    *****
//    *****

function t12() {

}
document.querySelector('.b-12').onclick = t12;


// Задачи на прокачку 4
// С помощью вложенных циклов и символа * нарисуйте:

//    *****
//    ****
//    ***
//    **
//    *


function t14() {

}
document.querySelector('.b-14').onclick = t14;

// Задачи на прокачку 5
// С помощью вложенных циклов и символа * нарисуйте:

//   *****
//  *****
// *****


function t15() {   

}
document.querySelector('.b-15').onclick = t15;

// Задачи на прокачку 6
	
// С помощью вложенных циклов и символа * нарисуйте:

// *
// **
// ***
// **
// *


function t16()  {

}

document.querySelector('.b-16').onclick = t16;

// Задачи на прокачку 7
//С помощью вложенных циклов и символа * нарисуйте:
// ******
// *       *
// *       *
// *       *
// ******

function t17()  {

}

document.querySelector('.b-17').onclick = t17;


// Задачи на прокачку 8
//С помощью вложенных циклов нарисуйте, цифры - из счетчиков цикла:
// 5 4 3 2 1
// 4 3 2 1
// 3 2 1
// 2 1
// 1
function t18()  {

}

document.querySelector('.b-18').onclick = t18;


// Задачи на прокачку 9
// С помощью вложенных циклов нарисуйте, цифры - из счетчиков цикла:
// 1
// 2 1
// 3 2 1
// 4 3 2 1
// 5 4 3 2 1

function t19()  {

}

document.querySelector('.b-19').onclick = t19;


// Задачи на прокачку 10
// С помощью вложенных циклов нарисуйте, цифры - из счетчиков цикла:
// X X X X 1
// X X X 2 1
// X X 3 2 1
// X 4 3 2 1
// 5 4 3 2 1

function t20()  {

}

document.querySelector('.b-20').onclick = t20;


// Задачи на прокачку 11
// С помощью вложенных циклов нарисуйте, цифры - из счетчиков цикла:
// 1
// 2  2
// 3  3  3
// 4  4  4  4
// 5  5  5  5  5

function t21()  {

}

document.querySelector('.b-21').onclick = t21;


// Задачи на прокачку 12
// С помощью вложенных циклов нарисуйте, цифры - из счетчиков цикла (четные заменены на X):
// 5
// X  X
// 3  3  3
// X  X  X  X
// 1  1  1  1  1

function t22()  {

}

document.querySelector('.b-22').onclick = t22;

// Задачи на прокачку 13
// С помощью вложенных циклов и символа * нарисуйте:
//   *****
//  *******
// *********

function t23()  {

}

document.querySelector('.b-23').onclick = t23;


// Задачи на прокачку 14
// С помощью вложенных циклов и символа * нарисуйте:
//    **
//   ****
//  ******
//   ****
//    **

function t24()  {

}

document.querySelector('.b-24').onclick = t24;